saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Infineon.TLE987x_DFP.1.3.2.pdsc
        <file category="header" name="Device\SDK\cfgwiz\common\bdrv_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\ccu6_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\ccu6_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\ccu6_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\ccu6_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\ccu6_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\ccu6_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\ccu6_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\ccu6_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\csa_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\gpt12e_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\gpt12e_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\gpt12e_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\gpt12e_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\gpt12e_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\gpt12e_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\gpt12e_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\gpt12e_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\int_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\isr_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\lin_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\mon_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\port_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\ssc_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\ssc_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\ssc_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\ssc_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\ssc_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\ssc_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\ssc_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\ssc_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\timer2x_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\timer2x_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\timer2x_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\timer2x_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\timer2x_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\timer2x_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\timer2x_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\timer2x_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\timer3_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\timer3_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\timer3_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\timer3_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\timer3_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\timer3_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\timer3_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\timer3_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\uart_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\uart_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\uart_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\uart_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\uart_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\uart_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\uart_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.6"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\uart_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.6"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\dma_defines.h" attr="config" condition="TLE987x" version="1.8.6"/>      

        <file category="doc" name="Device\SDK\cfgwiz\script\ICW_TLE987x.xml" attr="config" condition="TLE987x" version="1.3.1"/>      
     </files>
    </component>

    <component Cclass="Device" Cgroup="BF-Stepping" Cversion="0.0.1" condition="TLE987xABF">
      <description>Select if target device is BF-Stepping</description>
      <RTE_Components_h>
        #define RTE_DEVICE_BF_STEP
      </RTE_Components_h>
      <files>
        <file category="doc" name="Documents/bf_stepping.html"/>
      </files>	  
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.3.1" condition="TLE987x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SCU
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device\SDK\inc\lin.h" version="0.1.5"/>
        <file category="header" attr="config" name="Device\SDK\inc\scu.h" version="0.3.1"/>
        <file category="source" attr="config" name="Device\SDK\src\scu.c" version="0.3.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" Cversion="0.2.1" condition="TLE987x CMSIS Device">
      <description>BootROM driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_BROM
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device\SDK\inc\bootrom.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device\SDK\src\bootrom.c" version="0.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.6" condition="TLE987x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_WDT1
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device\SDK\inc\wdt1.h" version="0.2.6"/>
        <file category="source" attr="config" name="Device\SDK\src\wdt1.c" version="0.2.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PMU" Cversion="0.1.3" condition="TLE987x CMSIS Device">
      <description>Power Management Unit (SCU) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PMU
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device\SDK\inc\pmu.h" version="0.1.3"/>
        <file category="source" attr="config" name="Device\SDK\src\pmu.c" version="0.1.3"/>
      </files>
    </component>

